2356. Number of Unique Subjects Taught by Each Teacher

In [4]:
import pandas as pd

In [5]:
data = [[1, 2, 3], [1, 2, 4], [1, 3, 3], [2, 1, 1], [2, 2, 1], [2, 3, 1], [2, 4, 1]]
teacher = pd.DataFrame(data, columns=['teacher_id', 'subject_id', 'dept_id']).astype({'teacher_id':'Int64', 'subject_id':'Int64', 'dept_id':'Int64'})

In [6]:
teacher

   teacher_id  subject_id  dept_id
0           1           2        3
1           1           2        4
2           1           3        3
3           2           1        1
4           2           2        1
5           2           3        1
6           2           4        1

In [10]:
result = teacher.groupby('teacher_id')['subject_id'].nunique().reset_index(name='cnt')

In [11]:
result

   teacher_id  cnt
0           1    2
1           2    4